nickfox-taterli/SWM34_LCD/Source/Board/OTM8009A.c
  // cbdx                                                                                                                            
  LCD_WriteCommand(0xCB,0xd0); LCD_WriteData(0x00);	//cbd1[7:0] : enmode H-byte of sig16 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd1); LCD_WriteData(0x00);	//cbd2[7:0] : enmode H-byte of sig17 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd2); LCD_WriteData(0x00);	//cbd3[7:0] : enmode H-byte of sig18 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd3); LCD_WriteData(0x00);	//cbd4[7:0] : enmode H-byte of sig19 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd4); LCD_WriteData(0x00);	//cbd5[7:0] : enmode H-byte of sig20 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd5); LCD_WriteData(0x00);	//cbd6[7:0] : enmode H-byte of sig21 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd6); LCD_WriteData(0x00);	//cbd7[7:0] : enmode H-byte of sig22 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd7); LCD_WriteData(0x00);	//cbd8[7:0] : enmode H-byte of sig23 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd8); LCD_WriteData(0x00);	//cbd9[7:0] : enmode H-byte of sig24 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xd9); LCD_WriteData(0x04);	//cbda[7:0] : enmode H-byte of sig25 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xda); LCD_WriteData(0x04);	//cbdb[7:0] : enmode H-byte of sig26 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xdb); LCD_WriteData(0x04);	//cbdc[7:0] : enmode H-byte of sig27 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xdc); LCD_WriteData(0x04);	//cbdd[7:0] : enmode H-byte of sig28 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xdd); LCD_WriteData(0x04);	//cbde[7:0] : enmode H-byte of sig29 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xde); LCD_WriteData(0x04);	//cbdf[7:0] : enmode H-byte of sig30 (pwrof_0, pwrof_1, norm, pwron_4 )                          
                                                             
  // cbex                                                    
  LCD_WriteCommand(0xCB,0xe0); LCD_WriteData(0x00);	//cbe1[7:0] : enmode H-byte of sig31 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xe1); LCD_WriteData(0x00);	//cbe2[7:0] : enmode H-byte of sig32 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xe2); LCD_WriteData(0x00);	//cbe3[7:0] : enmode H-byte of sig33 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xe3); LCD_WriteData(0x00);	//cbe4[7:0] : enmode H-byte of sig34 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xe4); LCD_WriteData(0x00);	//cbe5[7:0] : enmode H-byte of sig35 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xe5); LCD_WriteData(0x00);	//cbe6[7:0] : enmode H-byte of sig36 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xe6); LCD_WriteData(0x00);	//cbe7[7:0] : enmode H-byte of sig37 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xe7); LCD_WriteData(0x00);	//cbe8[7:0] : enmode H-byte of sig38 (pwrof_0, pwrof_1, norm, pwron_4 )                          
  LCD_WriteCommand(0xCB,0xe8); LCD_WriteData(0x00);	//cbe9[7:0] : enmode H-byte of sig39 (pwrof_0, pwrof_1, norm, pwron_4 )                                                                                                  
  LCD_WriteCommand(0xCB,0xe9); LCD_WriteData(0x00);	//cbea[7:0] : enmode H-byte of sig40 (pwrof_0, pwrof_1, norm, pwron_4 )                                                                                                  
                                                  
  // cc8x                                         
  LCD_WriteCommand(0xCC,0x80); LCD_WriteData(0x00);	//cc81[7:0] : reg setting for signal01 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x81); LCD_WriteData(0x00);	//cc82[7:0] : reg setting for signal02 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x82); LCD_WriteData(0x00);	//cc83[7:0] : reg setting for signal03 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x83); LCD_WriteData(0x00);	//cc84[7:0] : reg setting for signal04 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x84); LCD_WriteData(0x0C);	//cc85[7:0] : reg setting for signal05 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x85); LCD_WriteData(0x0A);	//cc86[7:0] : reg setting for signal06 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x86); LCD_WriteData(0x10);	//cc87[7:0] : reg setting for signal07 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x87); LCD_WriteData(0x0E);	//cc88[7:0] : reg setting for signal08 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x88); LCD_WriteData(0x03);	//cc89[7:0] : reg setting for signal09 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x89); LCD_WriteData(0x04);	//cc8a[7:0] : reg setting for signal10 selection with u2d mode                                   
                                                                                                                                     
  // cc9x                                                                                                                            
  LCD_WriteCommand(0xCC,0x90); LCD_WriteData(0x00);	//cc91[7:0] : reg setting for signal11 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x91); LCD_WriteData(0x00);	//cc92[7:0] : reg setting for signal12 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x92); LCD_WriteData(0x00);	//cc93[7:0] : reg setting for signal13 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x93); LCD_WriteData(0x00);	//cc94[7:0] : reg setting for signal14 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x94); LCD_WriteData(0x00);	//cc95[7:0] : reg setting for signal15 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x95); LCD_WriteData(0x00);	//cc96[7:0] : reg setting for signal16 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x96); LCD_WriteData(0x00);	//cc97[7:0] : reg setting for signal17 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x97); LCD_WriteData(0x00);	//cc98[7:0] : reg setting for signal18 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x98); LCD_WriteData(0x00);	//cc99[7:0] : reg setting for signal19 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x99); LCD_WriteData(0x00);	//cc9a[7:0] : reg setting for signal20 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x9a); LCD_WriteData(0x00);	//cc9b[7:0] : reg setting for signal21 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x9b); LCD_WriteData(0x00);	//cc9c[7:0] : reg setting for signal22 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x9c); LCD_WriteData(0x00);	//cc9d[7:0] : reg setting for signal23 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x9d); LCD_WriteData(0x00);	//cc9e[7:0] : reg setting for signal24 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0x9e); LCD_WriteData(0x0B);	//cc9f[7:0] : reg setting for signal25 selection with u2d mode                                   
                                                                                                                                     
