nickfox-taterli/SWM34_LCD/Source/Board/OTM8009A.c
  // ccax                                                                                                                            
  LCD_WriteCommand(0xCC,0xa0); LCD_WriteData(0x09);	//cca1[7:0] : reg setting for signal26 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa1); LCD_WriteData(0x0F);	//cca2[7:0] : reg setting for signal27 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa2); LCD_WriteData(0x0D);	//cca3[7:0] : reg setting for signal28 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa3); LCD_WriteData(0x01);	//cca4[7:0] : reg setting for signal29 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa4); LCD_WriteData(0x02);	//cca5[7:0] : reg setting for signal20 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa5); LCD_WriteData(0x00);	//cca6[7:0] : reg setting for signal31 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa6); LCD_WriteData(0x00);	//cca7[7:0] : reg setting for signal32 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa7); LCD_WriteData(0x00);	//cca8[7:0] : reg setting for signal33 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa8); LCD_WriteData(0x00);	//cca9[7:0] : reg setting for signal34 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xa9); LCD_WriteData(0x00);	//ccaa[7:0] : reg setting for signal35 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xaa); LCD_WriteData(0x00);	//ccab[7:0] : reg setting for signal36 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xab); LCD_WriteData(0x00);	//ccac[7:0] : reg setting for signal37 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xac); LCD_WriteData(0x00);	//ccad[7:0] : reg setting for signal38 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xad); LCD_WriteData(0x00);	//ccae[7:0] : reg setting for signal39 selection with u2d mode                                   
  LCD_WriteCommand(0xCC,0xae); LCD_WriteData(0x00);	//ccaf[7:0] : reg setting for signal40 selection with u2d mode                                   
                                                                                                                                     
  // ccbx                                                                                                                            
  LCD_WriteCommand(0xCC,0xb0); LCD_WriteData(0x00);	//ccb1[7:0] : reg setting for signal01 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb1); LCD_WriteData(0x00);	//ccb2[7:0] : reg setting for signal02 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb2); LCD_WriteData(0x00);	//ccb3[7:0] : reg setting for signal03 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb3); LCD_WriteData(0x00);	//ccb4[7:0] : reg setting for signal04 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb4); LCD_WriteData(0x0D);	//ccb5[7:0] : reg setting for signal05 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb5); LCD_WriteData(0x0F);	//ccb6[7:0] : reg setting for signal06 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb6); LCD_WriteData(0x09);	//ccb7[7:0] : reg setting for signal07 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb7); LCD_WriteData(0x0B);	//ccb8[7:0] : reg setting for signal08 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb8); LCD_WriteData(0x02);	//ccb9[7:0] : reg setting for signal09 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xb9); LCD_WriteData(0x01);	//ccba[7:0] : reg setting for signal10 selection with d2u mode                                   
                                                                                                                                     
  // cccx                                                                                                                            
  LCD_WriteCommand(0xCC,0xc0); LCD_WriteData(0x00);	//ccc1[7:0] : reg setting for signal11 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc1); LCD_WriteData(0x00);	//ccc2[7:0] : reg setting for signal12 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc2); LCD_WriteData(0x00);	//ccc3[7:0] : reg setting for signal13 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc3); LCD_WriteData(0x00);	//ccc4[7:0] : reg setting for signal14 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc4); LCD_WriteData(0x00);	//ccc5[7:0] : reg setting for signal15 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc5); LCD_WriteData(0x00);	//ccc6[7:0] : reg setting for signal16 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc6); LCD_WriteData(0x00);	//ccc7[7:0] : reg setting for signal17 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc7); LCD_WriteData(0x00);	//ccc8[7:0] : reg setting for signal18 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc8); LCD_WriteData(0x00);	//ccc9[7:0] : reg setting for signal19 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xc9); LCD_WriteData(0x00);	//ccca[7:0] : reg setting for signal20 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xca); LCD_WriteData(0x00);	//cccb[7:0] : reg setting for signal21 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xcb); LCD_WriteData(0x00);	//cccc[7:0] : reg setting for signal22 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xcc); LCD_WriteData(0x00);	//cccd[7:0] : reg setting for signal23 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xcd); LCD_WriteData(0x00);	//ccce[7:0] : reg setting for signal24 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xce); LCD_WriteData(0x0E);	//cccf[7:0] : reg setting for signal25 selection with d2u mode                                   
                                                                                                                                     
  // ccdx                                                                                                                            
  LCD_WriteCommand(0xCC,0xd0); LCD_WriteData(0x10);	//ccd1[7:0] : reg setting for signal26 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd1); LCD_WriteData(0x0A);	//ccd2[7:0] : reg setting for signal27 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd2); LCD_WriteData(0x0C);	//ccd3[7:0] : reg setting for signal28 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd3); LCD_WriteData(0x04);	//ccd4[7:0] : reg setting for signal29 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd4); LCD_WriteData(0x03);	//ccd5[7:0] : reg setting for signal30 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd5); LCD_WriteData(0x00);	//ccd6[7:0] : reg setting for signal31 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd6); LCD_WriteData(0x00);	//ccd7[7:0] : reg setting for signal32 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd7); LCD_WriteData(0x00);	//ccd8[7:0] : reg setting for signal33 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd8); LCD_WriteData(0x00);	//ccd9[7:0] : reg setting for signal34 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xd9); LCD_WriteData(0x00);	//ccda[7:0] : reg setting for signal35 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xda); LCD_WriteData(0x00);	//ccdb[7:0] : reg setting for signal36 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xdb); LCD_WriteData(0x00);	//ccdc[7:0] : reg setting for signal37 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xdc); LCD_WriteData(0x00);	//ccdd[7:0] : reg setting for signal38 selection with d2u mode                                   
  LCD_WriteCommand(0xCC,0xdd); LCD_WriteData(0x00);	//ccde[7:0] : reg setting for signal39 selection with d2u mode                    
  LCD_WriteCommand(0xCC,0xde); LCD_WriteData(0x00);	//ccdf[7:0] : reg setting for signal40 selection with d2u mode                    
                        
  ///=====================,0x========
  LCD_WriteCommand(0x3A,0x00); LCD_WriteData(0x77);     //RGB 32bits D[23:0]

  LCD_WriteCommand(0x11,0x00);
  SYS_Delay(20);	        
  LCD_WriteCommand(0x29,0x00);
  SYS_Delay(20);     
  LCD_WriteCommand(0x2c,0x00);
  SYS_Delay(20);
}